app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Nuevo articulo 3"], ["body", "Este es el tercer articulo"], ["created_at", "2017-09-10 19:54:09.748016"], ["updated_at", "2017-09-10 19:54:09.748016"]]
---
  def create
    @article = Article.new(title: params[:article][:title],
                          body: params[:article][:body])

    if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 5]]
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy #Elimina datos de la base de datos